Return-Path: <bpf+bounces-75197-lists+bpf=lfdr.de@vger.kernel.org>
X-Original-To: lists+bpf@lfdr.de
Delivered-To: lists+bpf@lfdr.de
Received: from dfw.mirrors.kernel.org (dfw.mirrors.kernel.org [142.0.200.124])
	by mail.lfdr.de (Postfix) with ESMTPS id 2C5E4C76786
	for <lists+bpf@lfdr.de>; Thu, 20 Nov 2025 23:20:07 +0100 (CET)
Received: from smtp.subspace.kernel.org (relay.kernel.org [52.25.139.140])
	(using TLSv1.2 with cipher ECDHE-ECDSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by dfw.mirrors.kernel.org (Postfix) with ESMTPS id BF7254E2148
	for <lists+bpf@lfdr.de>; Thu, 20 Nov 2025 22:20:05 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id 0C48326AA91;
	Thu, 20 Nov 2025 22:19:59 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org;
	dkim=pass (2048-bit key) header.d=oracle.com header.i=@oracle.com header.b="QiG7Yq8W";
	dkim=pass (1024-bit key) header.d=oracle.onmicrosoft.com header.i=@oracle.onmicrosoft.com header.b="a7Bxm8dp"
X-Original-To: bpf@vger.kernel.org
Received: from mx0b-00069f02.pphosted.com (mx0b-00069f02.pphosted.com [205.220.177.32])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id 65897182B7
	for <bpf@vger.kernel.org>; Thu, 20 Nov 2025 22:19:56 +0000 (UTC)

 =?utf-8?B?bHpkT3I5UXdqcVlmYnhSU2FIRmJDK3I0WjJKSzZsbnJhdElsTEdRaUxpcXJV?=
 =?utf-8?B?WE45MGYvWlN5S1NKY1d0VFhScnN6a3E1Wk4yVUs1NW1SSUdBMGFPNEVCc0dK?=
 =?utf-8?B?cTJ3WDdrT3ZSS0dNci9TTGFqd1ZMSlNBdmdwS3lscXhyc01FaFU0V3VqQmZj?=
 =?utf-8?B?RW84MFV4ZGhtdjV2dUM1QzdkUXU4Sm03VitjanhrNmtpUExrMUM1dCtURXhR?=
 =?utf-8?B?T04xUVRmcFBidWl6cjhsUEtLVjFuQzhkRjNDdEpXbkhwaDJxbnIxR1FaZjAw?=
 =?utf-8?B?MzJEZlhhcGNrd2hMYWJ6a01sbjM0QjJoQW1TNEV4RGxaU1FMVkl1QTBhbXFt?=
 =?utf-8?B?cmdVWVMyWGpraW13K1RvOU9GNUl2OENUUld6cU9ITnMyQ0ZNNnkvaGxGd1Fk?=
 =?utf-8?B?SHA1TmdHZk41d25lTWk5cXhBUmFaRXRoMHl1M1lNb1lIME5qTTF2VGVPeG0r?=
 =?utf-8?B?dit2SDE0Qlpqc0lHZi9DYnRSSHRTYVpOSlBXcjVva1ZSZ09aeTZ0azR5cGtC?=
 =?utf-8?B?RGR1WmZJTDZNV2s1SjViMXBFOHUxZGxPVVdYTnpqSHRDNHRDOWwrZk5walMr?=
 =?utf-8?B?MnlybXdFaGxKUGtibkNUdDlaM2tkRFFPWXFDSmRDMnlNQTBxRk1tUXg1NHI1?=
 =?utf-8?B?SmoxeW8zU2plQXpjdTN3b1dDOWNoazlzSDZZYXdmS0s2ZEZyMndNRXVSZTRV?=
 =?utf-8?B?MzZJaHpUSk9MN2U2NXVvL2R3MTdjRll0dTByczNSTDF6S3dOTllacWN5aTZx?=
 =?utf-8?B?OTZsaDd3c1ZWZklEaWpTejNYL29MNDJDeTlaWllxck82bmM3dWZLS3luaTZD?=
 =?utf-8?B?VmZvMjlTSHVpTzVEcytUZytwOVZva2YxTEROeDh6TmI0TG5vdVBjbjE1QTlM?=
 =?utf-8?B?dmEwWVFJTFROSCtHWFBOdjhJVWdyVStOWVBOaVJGQXJONHZzREhIdzBRMUFY?=
 =?utf-8?B?VEE9PQ==?=
X-MS-Exchange-AntiSpam-ExternalHop-MessageData-ChunkCount: 1
X-MS-Exchange-AntiSpam-ExternalHop-MessageData-0:
	vu5YnhJ623JVPWJ9KszVI2543TzjwhQjFD1PJRI1uyt7hI2Yk7Ubbm4G4RsV1rbWSafCj3g+2Q5v8YV0GHZQJ2QkP89US00Qxe+jbyhwV1wi91zPv7ihJ6h1axv8cuIXBJTz+S1nfx3ih8a6qSXHZP4n5WVRqh1i6DOK7k464g5pZZOkS9ZPnUniyeioBdTKvb4vE1dkoXycYxdMW95Olb8lBMS+/F8p8zmwH5IvEEgQAmwRJ4rnQJnYmaLJeuvHdPM/iGX9kZOVFFNPyLajpSSrJL4sqHp0WwUoZfgltqseBr/h/GfFN/RNioxd08iIEqOl6H82MdtZi6rCulo0aETUl9AUUp/8k6pToh/RKIqTB/XvnYsp3cr4EUU6/L4+nsh8TC4qyECrkR+agQu15PGIMwmnXHdlF5Nq1866qYyIqTnAsBXwuqcJuQmux0UGxhEA1T3HxAYiVouGtojaYRwXlmiff7PKmnVBPjbz6y/MC2idCE6RDFS40Roj9XuGZ8qi0Q28lTkhMdlaryKoVNdZE3GUq29ycgOl9MpMNSA3rS6x2FHnuo76acuCBbyhj13y1xoRYFKS8/grVtaD2YqbarDoPtzEdDDH406AHS0=
X-OriginatorOrg: oracle.com
X-MS-Exchange-CrossTenant-Network-Message-Id: 40045619-7555-4253-3234-08de2882bd7c
X-MS-Exchange-CrossTenant-AuthSource: DS0PR10MB6271.namprd10.prod.outlook.com
X-MS-Exchange-CrossTenant-AuthAs: Internal
X-MS-Exchange-CrossTenant-OriginalArrivalTime: 20 Nov 2025 22:18:32.6021
 (UTC)
X-MS-Exchange-CrossTenant-FromEntityHeader: Hosted
X-MS-Exchange-CrossTenant-Id: 4e2c6054-71cb-48f1-bd6c-3a9705aca71b
X-MS-Exchange-CrossTenant-MailboxType: HOSTED
X-MS-Exchange-CrossTenant-UserPrincipalName: AiEFl91RjPDe5NrF2bgM9KJ1qU5T6b13xvvZ0psHriqIcSmUE23MQLF7O5nitNEVk2wlDVC3wyiTh6k2bg1rXA==
X-MS-Exchange-Transport-CrossTenantHeadersStamped: BLAPR10MB5122
X-Proofpoint-Virus-Version: vendor=baseguard
 engine=ICAP:2.0.293,Aquarius:18.0.1121,Hydra:6.1.9,FMLib:17.12.100.49
 definitions=2025-11-20_09,2025-11-20_01,2025-10-01_01
X-Proofpoint-Spam-Details: rule=notspam policy=default score=0 adultscore=0 phishscore=0 bulkscore=0
 suspectscore=0 mlxscore=0 mlxlogscore=999 spamscore=0 malwarescore=0
 classifier=spam adjust=0 reason=mlx scancount=1 engine=8.12.0-2510240000
 definitions=main-2511200157
X-Authority-Analysis: v=2.4 cv=BoqQAIX5 c=1 sm=1 tr=0 ts=691f93bf b=1 cx=c_pps
 a=e1sVV491RgrpLwSTMOnk8w==:117 a=e1sVV491RgrpLwSTMOnk8w==:17
 a=6eWqkTHjU83fiwn7nKZWdM+Sl24=:19 a=z/mQ4Ysz8XfWz/Q5cLBRGdckG28=:19
 a=lCpzRmAYbLLaTzLvsPZ7Mbvzbb8=:19 a=xqWC_Br6kY4A:10 a=IkcTkHD0fZMA:10
 a=6UeiqGixMTsA:10 a=GoEa3M9JfhUA:10 a=VkNPw1HP01LnGYTKEx00:22
 a=QV9UqLgA4Q9WNwrmhG0A:9 a=QEXdDO2ut3YA:10 cc=ntf awl=host:13642
X-Proofpoint-ORIG-GUID: ojXQKqwcXU7WvW4rfkCRLqJy9CAHPW2A
X-Proofpoint-Spam-Details-Enc: AW1haW4tMjUxMTE1MDAzMiBTYWx0ZWRfX29JQXiEATcxN
 QGs+orHfeq8Y3m/fHtTvRfQWP+hwIreCx3FF059i2B5Bck8ikvo7iCYIPiw+jwnW3V7II4pUqHi
 JoNpPpITMdE+vAT8RKtzqcUCuf0uXSaLSUfYewqoFjbcSOjSbr2DNuWpeZXMVJbvEW6RbYo3Zey
 S7EOqzMvSFeqDip2U2X2RwKfkWPLf6Xu/P+VaeCjhS8r/UxZgaSbT7ROUt7kOlOEqgJcVL9T8Hu
 XLEWqFKl/k07AQivD4PCtfX6ZDfQNqdPKEuCw9fGJluFJEV3bRyimjWOPzyFnCIV7WTdyBTiudu
 76kmUWFTSKo04c04+IJVVnSHOWzRzOiyzl6CF84fN+dSZqVeGa+YxcUZY2iTK3OQHjt3+HRosiP
 Rxgv4G3vndVcZV8ho8RA8BiPkoGimx2985khIjpAFRJezOl6KZk=
X-Proofpoint-GUID: ojXQKqwcXU7WvW4rfkCRLqJy9CAHPW2A

On 20/11/2025 18:05, Potnuri Bharat Teja wrote:
> On Thursday, November 11/20/25, 2025 at 23:23:39 +0530, Alan Maguire wrote:
>> On 20/11/2025 14:20, Alan Maguire wrote:
>>> On 18/11/2025 16:47, Bart Van Assche wrote:
>>>> On 11/18/25 4:07 AM, Alan Maguire wrote:
>>>>> hi Bart, thanks for the report! Not a know issue to me at least; I tried
>>>>> to reproduce it with pahole v1.31 + gcc 12 and no luck. Would you mind
>>>>> sharing a few additional details:
>>>>>
>>>>> - compiler version
>>>>> - pahole version
>>>>> - full .config
>>>>
>>>> Hi Alan,
>>>>
>>>> My answers to your questions are as follows:
>>>> * Compiler version: gcc version 14.2.0 (Debian 14.2.0-19+build5)
>>>> * pahole version: v1.30
>>>> * Kernel config: has been attached to this email.
>>>>
>>>
>>> thanks Bart! I've reproduced this now with gcc-14.2.1 + pahole 1.30 and
>>> it is also observed with latest pahole 1.31. Investigating now, but if
>>> you want to work around it in the short term, disabling CONFIG_WERROR
>>> should allow resolve_btfids to proceed even where duplicate types are
>>> present. Hopefully we will have a root cause/fix shortly though. Thanks
>>> again for the report!
>>>
>>
>> [adding cxgb4 maintainer, for reasons that will become clearer below.
>> Context here is that Bart is seeing kernel builds fail at the
>> resolve_btfids stage; resolve_btfids is finding the BPF Type Format
>> representation of core kernel data structures has duplicate entries for
>> key kernel data structures like task_struct]
> 
>>
>> After adding some debug-only messaging to btf__dedup() in libbpf (which
>> I will send as a patch as it makes debugging these situations much
>> easier) I saw:
>>
>> libbpf: struct 'task_struct' (size 2560 vlen 194) appears equivalent but
>> differs for 23-indexed cand/canon member 'sched_class'/'sched_class': 0
>>
>> Examining sched_class we see:
>>
>> [107] STRUCT 'task_struct' size=2560 vlen=194
>> 	...
>>         'sched_class' type_id=480 bits_offset=5440
>> 	...
>>
>> [479] CONST '(anon)' type_id=8624
>> [480] PTR '(anon)' type_id=479
>>
>> [8624] STRUCT 'sched_class' size=216 vlen=27
>>         'enqueue_task' type_id=8844 bits_offset=0
>>         'dequeue_task' type_id=8846 bits_offset=64
>>         'yield_task' type_id=8823 bits_offset=128
>>         'yield_to_task' type_id=8848 bits_offset=192
>>         'wakeup_preempt' type_id=8844 bits_offset=256
>>         'balance' type_id=8851 bits_offset=320
>>         'pick_task' type_id=8853 bits_offset=384
>>         'pick_next_task' type_id=8855 bits_offset=448
>>         'put_prev_task' type_id=8857 bits_offset=512
>>         'set_next_task' type_id=8859 bits_offset=576
>>         'select_task_rq' type_id=8861 bits_offset=640
>>         'migrate_task_rq' type_id=8863 bits_offset=704
>>         'task_woken' type_id=8865 bits_offset=768
>>         'set_cpus_allowed' type_id=8868 bits_offset=832
>>         'rq_online' type_id=8823 bits_offset=896
>>         'rq_offline' type_id=8823 bits_offset=960
>>         'find_lock_rq' type_id=8870 bits_offset=1024
>>         'task_tick' type_id=8844 bits_offset=1088
>>         'task_fork' type_id=236 bits_offset=1152
>>         'task_dead' type_id=236 bits_offset=1216
>>         'switching_to' type_id=8865 bits_offset=1280
>>         'switched_from' type_id=8865 bits_offset=1344
>>         'switched_to' type_id=8865 bits_offset=1408
>>         'reweight_task' type_id=8873 bits_offset=1472
>>         'prio_changed' type_id=8844 bits_offset=1536
>>         'get_rr_interval' type_id=8875 bits_offset=1600
>>         'update_curr' type_id=8823 bits_offset=1664
>>
>>
>> Now looking at the first duplicate:
>>
>> [36354] STRUCT 'task_struct' size=2560 vlen=194
>> 	...
>>         'sched_class' type_id=36389 bits_offset=5440
>> 	...
>>
>>
>> [36387] STRUCT 'sched_class' size=64 vlen=6
>>         'state' type_id=28 bits_offset=0
>>         'idx' type_id=28 bits_offset=8
>>         'info' type_id=38195 bits_offset=32
>>         'bind_type' type_id=38228 bits_offset=256
>>         'entry_list' type_id=90 bits_offset=320
>>         'refcnt' type_id=84 bits_offset=448
>> [36388] CONST '(anon)' type_id=36387
>> [36389] PTR '(anon)' type_id=36388
>>
>>
>> sched_class looks totally different! The reason is cxgb4 declares its
>> own sched_class while also #include'ing task_struct-related headers.
>> Bart's config exposed this because he had CONFIG_CHELSIO_T4=y (I had 'm'
>> in my config).
>>
>> If we look at drivers/net/ethernet/chelsio/cxgb4/sched.h we indeed see:
>>
>> struct sched_class {
>>         u8 state;
>>         u8 idx;
>>         struct ch_sched_params info;
>>         enum sched_bind_type bind_type;
>>         struct list_head entry_list;
>>         atomic_t refcnt;
>> };
>>
>> ..and cxgb4_main.c has #include <linux/sched.h> and #include <sched.h>
>> with the clashing sched_class. Using pahole we can establish that the
>> BTF encoding is simply reflecting the DWARF representation ("pahole
>> cxgb4.ko" shows this), so BTF is effectively correctly reflecting the
>> underlying DWARF representation. This will make life confusing for
>> debuggers too.
>>
>> So although it is a bit of a pain, I would suggest the simplest approach
>> is to perhaps look at renaming sched_class to be a bit more
>> domain-specific - ch_sched_class perhaps? That way it will not clash
>> with task_struct's sched_class.
>>
>> I can send a patch but it would be great to get cxgb4 maintainers' take
>> here first.
> Thanks for adding me and the detailed debug, Alan and Bart.
> I will try this and let you know.

FYI I verified that changing sched_class to ch_sched_class like the
following resolves the build issue:

diff --git a/drivers/net/ethernet/chelsio/cxgb4/cxgb4_main.c
b/drivers/net/ethernet/chelsio/cxgb4/cxgb4_main.c
index 392723ef14e5..ac0c7fe5743b 100644
--- a/drivers/net/ethernet/chelsio/cxgb4/cxgb4_main.c
+++ b/drivers/net/ethernet/chelsio/cxgb4/cxgb4_main.c
@@ -3485,7 +3485,7 @@ static int cxgb_set_tx_maxrate(struct net_device
*dev, int index, u32 rate)
        struct adapter *adap = pi->adapter;
        struct ch_sched_queue qe = { 0 };
        struct ch_sched_params p = { 0 };
-       struct sched_class *e;
+       struct ch_sched_class *e;
        u32 req_rate;
        int err = 0;

diff --git a/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_matchall.c
b/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_matchall.c
index 1672d3afe5be..f8dcf0b4abcd 100644
--- a/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_matchall.c
+++ b/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_matchall.c
@@ -56,7 +56,7 @@ static int cxgb4_matchall_egress_validate(struct
net_device *dev,
        struct port_info *pi = netdev2pinfo(dev);
        struct flow_action_entry *entry;
        struct ch_sched_queue qe;
-       struct sched_class *e;
+       struct ch_sched_class *e;
        u64 max_link_rate;
        u32 i, speed;
        int ret;
@@ -180,7 +180,7 @@ static int cxgb4_matchall_alloc_tc(struct net_device
*dev,
        struct port_info *pi = netdev2pinfo(dev);
        struct adapter *adap = netdev2adap(dev);
        struct flow_action_entry *entry;
-       struct sched_class *e;
+       struct ch_sched_class *e;
        int ret;
        u32 i;

diff --git a/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_mqprio.c
b/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_mqprio.c
index 338b04f339b3..a2dcd2e24263 100644
--- a/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_mqprio.c
+++ b/drivers/net/ethernet/chelsio/cxgb4/cxgb4_tc_mqprio.c
@@ -330,7 +330,7 @@ static int cxgb4_mqprio_alloc_tc(struct net_device *dev,
        struct cxgb4_tc_port_mqprio *tc_port_mqprio;
        struct port_info *pi = netdev2pinfo(dev);
        struct adapter *adap = netdev2adap(dev);
-       struct sched_class *e;
+       struct ch_sched_class *e;
        int ret;
        u8 i;

diff --git a/drivers/net/ethernet/chelsio/cxgb4/sched.c
b/drivers/net/ethernet/chelsio/cxgb4/sched.c
index a1b14468d1ff..e15554b347c0 100644
--- a/drivers/net/ethernet/chelsio/cxgb4/sched.c
+++ b/drivers/net/ethernet/chelsio/cxgb4/sched.c
